# YOLOv12-DWT 🚀, AGPL-3.0 license
# YOLOv12 with DWT/IDWT-based symmetric up/downsampling replacing Conv stride 2 and nn.Upsample
# Backbone downsamples: layers 1,3 use DWT_DownsampleAll (all subbands + BN + SiLU); layers 5,7 use DWT_Downsample (LL-only + detail skip)
# Head downsamples: layers 15,18 use DWT_DownsampleAll; upsamples (layers 9,12) use IDWT_Upsample with detail from encoder DWT

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n-dwt.yaml' will call yolov12-dwt.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-DWT backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, DWT_DownsampleAll,  [128]] # 1-P2/4  (DWT all subbands: 64→256→128)
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, DWT_DownsampleAll,  [256]] # 3-P3/8  (DWT all subbands: 256→1024→256)
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, DWT_Downsample,  [512]] # 5-P4/16  (DWT: detail stored for layer 12)
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, DWT_Downsample,  [1024]] # 7-P5/32  (DWT: detail stored for layer 9)
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12-DWT head
head:
  - [-1, 1, IDWT_Upsample, [7]]  # 9  (IDWT upsample using detail from backbone layer 7)
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11

  - [-1, 1, IDWT_Upsample, [5]]  # 12  (IDWT upsample using detail from backbone layer 5)
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14

  - [-1, 1, DWT_DownsampleAll, [256]] # 15  (DWT all subbands: 256→1024→256)
  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 17

  - [-1, 1, DWT_DownsampleAll, [512]] # 18  (DWT all subbands: 512→2048→512)
  - [[-1, 8], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]] # Detect(P3, P4, P5)
